uat_chat/InformationRegisters/уатСоставТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатСоставТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВСоставе</Name>
					<Comment>(Общ) ТС, в состав которого входит текущее</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Comment>ТС или оборудование</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/уатСоставТС/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		Если ТекЗапись.ТС = ТекЗапись.ВСоставе Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Нельзя указывать в составе ТС или оборудование само на себя!", Отказ,,СтатусСообщения.Внимание);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	уатСоставТС.ТС,
		|	уатСоставТС.ВСоставе
		|ИЗ
		|	РегистрСведений.уатСоставТС КАК уатСоставТС
		|ГДЕ
		|	уатСоставТС.ТС = &ТС
		|	И уатСоставТС.ВСоставе = &ВСоставе";
		
		Запрос.УстановитьПараметр("ТС", ТекЗапись.ВСоставе);
		Запрос.УстановитьПараметр("ВСоставе", ТекЗапись.ТС);
		
		Результат = Запрос.Выполнить().Выгрузить().Количество();
		Если Результат Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Невозможно произвести операцию. ТС """ + ТекЗапись.ТС + """ уже в составе ТС """ + ТекЗапись.ВСоставе + """!", Отказ,,СтатусСообщения.Внимание);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
